tap "homebrew/bundle"
tap "homebrew/services"

brew "apache-spark"
brew "autorestic"
brew "autossh"
brew "python@3.11"
brew "awscli"
brew "duckdb"
brew "eza"
brew "go"
brew "golangci-lint"
brew "httpie"
brew "ipcalc"
brew "jq"
brew "libpq", link: true
brew "mas"
brew "minio-mc"
brew "neofetch"
brew "neovim"
brew "rust"
brew "saml2aws"
brew "sbt"
brew "scala"
brew "starship"
brew "syncthing"
brew "synergy-core", restart_service: true
brew "terraform"
brew "vault"
brew "watch"
brew "yadm"

cask "1password"
cask "1password-cli"
cask "docker"
cask "firefox"
cask "hex-fiend"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "mimestream"
cask "moonlight"
cask "nvidia-geforce-now"
cask "obsidian"
cask "postman"
cask "setapp"
cask "slack"
cask "spotify"
cask "tiles"
cask "tradingview"
cask "visual-studio-code"
cask "warp"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NextDNS", id: 1464122853
mas "Save to Raindrop.io", id: 1549370672
mas "Tailscale", id: 1475387142
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835

